use shopbuydb;





DELETE FROM m_category;
INSERT INTO m_category(
category_id, category_name, category_description
) VALUES (
1001 , "music" , "音楽です。"
),(
1002 , "book" , "本です"
);


DELETE FROM more_info;
INSERT INTO more_info(
more_id, more_name, more_name_kana, more_description, category_id, price, image_file_path, image_file_name, release_date, release_company
) VALUES (
1 , "シンプルなマイク", "しんぷるなまいく", "とてもシンプルなマイク。", 1001, 10000, "./img/1.jpg", "1.jpg", "2017-12-31 0:59:59", "良い会社"
),(
2 , "レトロなラッパ", "れとろならっぱ", "年季の入ったレトロなラッパ", 1001, 50000,  "./img/2.jpg", "2.jpg", "2017-12-31 0:59:59", "良い会社"
),(
3 , "豪華なドラムセット", "ごうかなどらむせっと", "かなり豪華なドラムセット", 1001, 1200000,  "./img/3.jpg", "3.jpg", "2017-12-31 0:59:59", "良い会社"
),(
4 , "簡単な楽譜", "かんたんながくふ", "初心者におすすめ", 1001, 1000,  "./img/4.jpg", "4.jpg", "2017-12-31 0:59:59", "良い会社"
),(
5 , "笑える本", "わらえるほん", "楽しい気分になりたい方以外は読まないでください", 1002, 480,  "./img/5.jpg", "5.jpg", "2017-12-31 0:59:59", "良い会社"
),(
6 , "考えさせられる小説", "かんがえさせられるしょうせつ", "あなたの大切なモノは何？", 1002, 500,  "./img/6.jpg", "6.jpg", "2017-12-31 0:59:59", "良い会社"
),(
7 , "本らしくない本", "ほんらしくないほん", "本と記してありますが本ではない何かです", 1002, 480,  "./img/7.jpg", "7.jpg", "2017-12-31 0:59:59", "良い会社"
),(
8 , "BOOKカバー", "ぶっくかばー", "耐久度は国が保証済みです", 1002, 520,  "./img/8.jpg", "8.jpg", "2017-12-31 0:59:59", "良い会社"
);

